revert: Revert the mermaid flowchart as GitHub pages doesn't support it
